Homoglyphs = { #UCSimList + StrongObfuscator from http://obfuscator.uo1.net/
 '"': '＂"',
 '#': '＃#﹟',
 '$': '＄$﹩',
 '%': '％%℅﹪',
 '&': '&＆﹠',
 "'": '＇',
 '(': '（(',
 ')': ')）',
 '*': '＊*∗',
 '+': '＋+﹢',
 ',': '，,‚’',
 '-': '\xad－‐‑╶╴ˉˍ-',
 '.': '˙．·･·․‧.ˑ﹒',
 '/': '／/',
 '0': '０0θ⓪ОO',
 '1': '１1¹₁①⑴⒈❶➊',
 '2': '２2ƻ²₂ՋԶ②⑵⒉❷➋➁',
 '3': '３3ვ³₃ƷӠʒЗҘҙз③⑶⒊❸➌➂',
 '4': '４4④⑷⒋❹➍➄',
 '5': '５5Ƽ⑤⑸⒌❺➎➅',
 '6': '6６ნმშϐ⑥⑹⒍❻➏',
 '7': '７7⑦⑺⒎❼➐',
 '8': '8８ϐѲӨƟΘ⑧⑻⒏❽➑',
 '9': '９9ｇg⑨⑼⒐❾➒',
 ':': '：׃∶:ː÷∸∻﹕',
 ';': ';;；﹔',
 '<': '＜<⋖﹤',
 '=': '＝=﹦₌⁼',
 '>': '>＞⋗﹥',
 '?': '?？﹖',
 '@': '＠@﹫',
 'a': 'ａaаΑＡАAẠạᾼḀḁąөɵΆลəәǝɐƨàáǎâăȃӑȁậặãāӓäåảᾱᾰǟǡẩɑαɒᾳѻʚάάὰᾶᾴᾲἁἀờᾷɗấầẫẵắằᾀἅᾁἂἃἄᾅởᾃᾂᾄðἆἇᾆᾇƌ@⒜ⓐ',
 'b': 'ВｂbΒＢBḄƅḅɓḆḇþƃƂხƀ␢ЬნҕƄსϬб⒝ⓑ',
 'c': 'сｃⅽcϲCＣⅭСєЄҀҪҫႺÇçɔɕćčĉċ⒞ⓒ',
 'd': 'dｄⅾDＤⅮḌḍɗďđḎḏḒḐḓƌḑɖძ⒟ⓓ',
 'e': 'eеｅΕEЕＥẸϱẹɘɵөḘḚḙḛɞĘѳęƂèéěêĕȇӗệȅḝёëēẽӫėӛέέὲἐεɛḗḕễẻếềể⒠ⓔ',
 'f': 'ｆfＦFƭϜГḟẛ⒡ⓕſ',
 'g': 'ɡgｇＧGǥǤĢϱĝǧğǵɠḡġցզ⒢ⓖ',
 'h': 'ｈhһΗＨНHḤḥῌɦҤӇḪẖḫҢĥḧħћђɧʰʱḣ⒣ⓗ',
 'i': 'IΙӀⅰіiｉІＩⅼǀⅠ¡ί׀ίƖἰἱỊḷ！ǃ!ịíİìîȋǐῐἳἲἴἵῑɨїϊïīĭῖΐΐῒȉןḭḬĺἶἷῗЇΪÏĨ⒤ⓘ',
 'j': 'јjϳｊЈJＪĵǰ］]⒥ⓙ',
 'k': 'ΚkｋKKＫḲƙḳĶķƘḴḵǩḱ⒦ⓚ',
 'l': 'ｌⅼⅬＬLǀl׀ĿḶίἱἰḷŀĻſļḺḼιıɩĺ｜|［⁅[ĮɭľῘῙ⁆ḹƚƗɫเʟḻḽ⒧ⓛ',
 'm': 'mМⅿｍⅯMＭΜṂṃɱḿṁⓜ',
 'n': 'nｎＮNΝṆŅṇпṈṊņƞηṉṋŋɳҧñṅňńήήὴῆ□▢ῃ◫ῄἠἡῂἥἢἣῇᾐᾑἤπװղդṷᾕᾓᾒᾔἦἧᾖᾗǹ⒩ⓝ',
 'o': 'ｏοоoΟＯОOỌọΘQөɵǪѻӨƟɒѺǫѳσρϱΩʊὂὅὃὄởỏδòὸόόóǒôŏờȏőȍộὀὁōõӧöӫǭơợȫȱȭṍṓṑỗốổồ⒪ⓞ',
 'p': 'pрｐΡPＰРρƿקקּṕþṗῥῤ⒫ⓟ',
 'q': 'qｑQＱϥɡg⒬ⓠ',
 'r': 'ｒrRＲṚŖгṞṛɾŗŕѓřȓṙɼſɽΓГՐ┌⒭ⓡ',
 's': 'ѕｓsЅSＳṢṣŞşႽśšŝʂṡṩ⒮ⓢ',
 't': 'ＴtｔTТΤṬƬṭŢŧţṮҬŦƭṰƫṯṱʈțťṫẗ⒯ⓣ',
 'u': 'uｕＵUỤụυṲṶṴṳʋɥŲџṷμṵųµцЏùúǔûŭὺȗύύῢῠΰΰűủȕὐῦὑūừῡũὒůὕὓὔüứϋữửưựǖṻῧǘǜǚṹטҶЧҸӋҷӌҹчṋὖὗ⒰ⓤ',
 'v': 'νⅴvｖⅤＶVṾѵṿѴƲѷṽγ⒱ⓥ',
 'w': 'ｗwＷWẈẉŵẁẃẘẇẅɯшɰщϣѡωѱψῳώώὼῴῶῲѿὡὠῷᾡᾠὥὢὣѽὤᾥᾣᾢᾤὦὧᾦᾧ⒲ⓦ',
 'x': 'xⅹхｘＸХXⅩΧҲҳẋẍ⒳ⓧ',
 'y': 'уｙyҮＹYΥỵỴƴҰýỳŷўӳẏỷӯẙÿỹӱγṿүӮӰӲЎ⒴ⓨ',
 'z': 'zｚΖZＺẒẓẔƵƶẕʐźžẑ⒵ⓩ',
 '[': '［[⁅ĺ',
 '\\': '＼',
 ']': ']］',
 '^': '^＾',
 'A': 'ลǝәəɐaаａạḁąөＡAΑАẠΆᾼḀÀÁǍÂᾸĂȂȀẬẶÃÅẢÄӐÅᾹӒĀǞǠẨẰẮȦἈᾺΆἉᾈẤẦẪẴẲᾉἊἋᾊᾋἌἍᾌᾍἎἏᾎᾏⒶ',
 'B': 'ВΒＢBbｂḄƅḅɓḆḇþƃƂხБʁʙвβϐცЬⒷ乃',
 'C': 'ⅭСＣCcсｃϲⅽєЄҀҪҫႺÇçɔɕĆČĈⒸ匚',
 'D': 'ⅮＤDｄdⅾḌḍɗďđḎḏḒḐḓƌḑɖძʠÐƉĐⒹᗪ',
 'E': 'ΕＥ乇ЕEеｅeẸẹɘɵөḘḚḙḛɞĘęɐƂÈÉÊĔȆӖỆȄḜËĒẼĖЁĚẺƎƩΣΈΈῈḖḔỄẾỀἐἑἕἓἒἔὲέέἘἙἚἛἜἝⒺ',
 'F': 'ＦF千ｆfƭϜΓГϝḞЃⒻ',
 'G': 'ＧᎶGｇɡgǥǤĢϱĜǦĞǴḠĠⒼ',
 'H': 'НΗHＨ卄ｈһhḤḥῌɦҤӇḪẖḫńΠПҢĤḢḦнʜҥңΉΉῊἨᾘҦӈҧἩᾙἪἫᾚᾛἬἭᾜᾝἮἯᾞᾟⒽ',
 'I': 'ǀlӀIΙＩⅼІⅠiіⅰｉ¡ί׀ίƖἰἱỊḷǃ!！ſịíļİ|｜ĮĺÍ⁅[［¦￤ÌǏĬľῘÎȊῙĪ⁆ḹẛÏЇΪĨἶἷ］]ǰĭïїῖϊΐΐīῒƗɫƚιıΊΊῚἸןḬḭἺἻἼἽἾἿⓛ', #卂乃匚ᗪ乇千Ꮆ卄丨ﾌҜㄥ爪几ㄖ卩Ɋ尺丂ㄒㄩᐯ山乂ㄚ乙
 'J': 'ЈJＪјjϳｊĵǰḭ]］ﾌⒿ',
 'K': 'ＫΚKKkｋҜḲƙḳĶķƘḴḵĸкҝқӄκǨḰКҜҚӃⓀ',
 'L': 'LＬⅬlｌ׀ĿḶƖίἰἱḷỊŀĻίļḺİíḼĹ[ʟɩเⓁ',
 'M': 'ＭⅯМΜｍⅿMmṂṃɱḾṀⓂ爪',
 'N': 'ＮΝNnｎṆŅṇпṈṊņƞηṉṋŋɳҧÑṄŇŃйӥӣӢӤⓃ',
 'O': 'ОＯΟOoоοｏỌọΘɑQөɵǪѻӨƟѺǫѳσÒÓǑÔŎȎŐỜỘȌỚỎÕÖỠǬŌӦӪѲӘƠỢȪȰȬȮΌΌὉΏṌṒṐỖṎỞỐỒỔὈὨῸὩΏὊὌὋὍὪὬὫὭⓄ',
 'P': 'ΡРPＰpрｐρɒƿÞṖṔⓅ卩',
 'Q': 'ＱQqႭｑỌǪϥǫǬⓆ',
 'R': 'RＲｒrṚŖгṞṛɾŗŔȒȐṘŘṜⓇ尺',
 'S': 'ЅSＳѕｓsṢṣŞşႽŚŠŜṤṠṨⓈ丂',
 'T': 'ТＴΤtｔTṬƬṭŢŧţҬṮŦƭṰƫṯƮҭтⓉ┬┭┑┯┮┰┒┓┱┳┲ㄒ',
 'U': 'UＵｕuỤụυṲṶṴṳʋɥŲџṷμṵųµцЏÙÚǓŬÛȖȔỪỦỨŨÜŰỬŪỮŮƯỰǕṺǗǛṸǙΰΰῢῦύύῠὺûȗúùǔŭȕűūῡὓὒὕὑũüὐὔϋủЦՄՍԱůῧὗὖǖṻⓊ',
 'V': 'VⅤＶⅴvｖνṾѵṿѴƲѶṼⓋ',
 'W': 'ＷWwｗẈẉŴẂẀẆẄШЩшɯщɰⓌ山',
 'X': 'XХＸΧⅩｘxⅹхҲҳẊẌⓍ乂',
 'Y': 'ҮＹYΥｙуyỵỴƴҰÝỲῨẎỶŶŸỸΫῩӰΎΎῪὙΨѰЧҸϤӋҶႷүұγὛㄚὝⓎ',
 'Z': 'ＺZΖｚzẒẓẔƵƶẕʐŹŽⓏ乙',
 '{': '{｛﹛',
 '}': '｝}',
 #'AE': 'ÆӔ',
 #'ae': 'æӕ',
 #'ii': 'ⅱǉĳ',
 'Ö': 'ȌȎŎÔŐǑỘÓÒỚỜÖÕỎ',
 'ö': 'ȍőŏǒȏôộóớòὸờόόδӧöὂōὄõὅὃỏ',
 'Ü': 'ȔÛȖǓŬÚÙỪŰỨŨỦÜỬŪ',
 'ü': 'ȕűȗûǔŭúΰΰùῦῠῢũūứὓủὕὒüừὔůύύὺῡϋ',
 '|': '︱︳｜|ļ∣丨ￜㅣᅵĮĺḷỊİÍɭ［[⁅།│╎▕▏￤¦┆ᅡㅏￂ༏',
 '~': '～~'
 }


StrongObfuscator = {} #source: http://obfuscator.uo1.net/
StrongObfuscator['A'] = "ÀÁÂÃÄÅĀĂĄǍǞǠȀȂȦΆΑАѦӐӒḀẠẢẤẦẨẬẶἈἉᾈᾉᾸᾹᾺᾼ₳ÅȺẮẰẲẴἌἎἏᾌΆǺẪ𝙰𝐴ᗅ𝑨𝚨𝕬𝖠АΑ𝛢𝝖𝒜𝜜𝓐𝞐Ａ𝗔𝘈Ꭺꓮ𝐀𝔸𐊠𝘼"
StrongObfuscator['B'] = "ƁΒВḂḄḆ𝕭𝙱𝑩𝚩ꓐΒВ𝜝𝛣𝖡𝝗𐊂𐌁𝗕Ｂ𝓑𝞑𝔅ℬ𝘉𝘽ꞴᏴ𝐁ᗷ𐊡𝐵𝔹 "
StrongObfuscator['C'] = "ÇĆĈĊČƇʗСҪḈ₢₵ℂⅭϹϾҀℂ𝕮𝙲𝑪𝒞𝖢𐌂𝗖ꓚᏟСＣⲤ𝓒Ⅽℭ𝘊𐐕𝘾🝌𝐂Ϲ𐊢𝐶 "
StrongObfuscator['D'] = "ÐĎĐƉƊḊḌḎḐḒⅮᎠ𝕯ⅅ𝓓𝙳𝔇ᗪ𝑫𝘋Ⅾ𝒟𝘿ꓓ𝐃𝖣𝐷𝗗𝔻ᗞ "
StrongObfuscator['E'] = "ÈÉÊËĒĔĖĘĚȄȆȨΕЀЁЕӖḘḚḜẸẺẼẾỀỆḔḖỂỄԐℇƐἙῈЄ𝛦𝑬𝚬𝜠𝖤ΕЕ𝗘𐊆𝝚𝓔𝞔Ｅ𝔈𝘌Ꭼℰ𝙀ꓰ𝐄𝐸ⴹ𝔼⋿𝕰"
StrongObfuscator['F'] = "ϜḞ₣ҒƑϝғҒ₣𝑭𝕱𝖥Ꞙ𝓕Ϝ𐊇ꓝ𝗙𝘍𝐅𝟊𝔉ℱ𝔽ᖴ𝙁𝙵𐊥𝐹"
StrongObfuscator['G'] = "ĜĞĠĢƓǤǦǴḠ₲Ꮐ𝑮𝘎𝕲𝐆𝖦Ԍ𝔊𝔾Ᏻ𝒢𝙂ꓖ𝓖𝙶𝐺𝗚"
StrongObfuscator['H'] = "ĤĦȞΗНҢҤӇӉḢḤḦḨḪῌꜦ𝑯𝚮𝕳𝛨𝖧ℋℌℍⲎ𐋏𝜢Η𝓗𝞖𝝜𝗛Н𝘏ꓧＨ𝐇𝙃𝙷Ꮋᕼ𝐻"
StrongObfuscator['I'] = "ΊÌÍÎÏĨĪĬĮİƖƗǏȈȊΙΪІЇӀӏḬḮỈỊἸἹῘῙῚǐ1𝚰𝘭І𝖨𝐥ﺍﺎ𝔩ℐℑ𐊊Ⲓ𐌉ℓ𝜤Ɩ𝞘Ι𝚕𝟏∣اＩ𝗅𝕀1𝙄𝓁𐌠𝐼𝑰ǀӀᛁ𝟭𝕴ߊｌ𝛪ⵏ𝝞𝕝𝟣𝙡𝓘𝗜𝟙𝑙ןⅠ𝘐١𝒍𝖑￨𝐈l۱ꓲ𝙸𝟷𝓵|ⅼ𝗹"
StrongObfuscator['J'] = "ĴʆЈʃ𝔍𝑱𝘑ЈＪ𝒥𝙅Ꭻᒍ𝐉𝖩Ʝ𝐽𝗝𝕁ꓙ𝕵𝓙𝙹Ϳ"
StrongObfuscator["K"] = "ĶƘǨΚЌКԞḰḲḴ₭K𝑲𝚱𝒦𝜥𝛫𝖪𝝟𝗞ⲔᛕꓗΚК𝓚𝞙𝔎𝘒ᏦK𝙆Ｋ𝐊𝐾𝕂𝙺"
StrongObfuscator["L"] = "ĹĻĽĿŁԼḶḸḺḼℒⅬ˪𝑳𝖫Ⳑ𝗟ℒ𝓛Ꮮ𝔏ꓡ𐐛𝘓𝙇ᒪⅬ𝐋𝐿𝕃𝕷𝙻"
StrongObfuscator["M"] = "ΜМӍḾṀṂⅯ𝛭𝑴𝚳𝜧𐌑𝖬𝗠ᛖ𝝡Ⲙ𝓜ΜМ𝞛ꓟ𝔐𝘔𝙈𐊰𝐌ＭⅯ𝑀ᗰℳ𝕄Ꮇ𝕸Ϻ𝙼"
StrongObfuscator["N"] = "ÑŃŅŇǸΝṄṆṈṊ₦Ɲꓠ𝛮𝐍𝖭𝚴𝔑𝜨Ｎ𝒩𝙉𝓝𝙽ℕ𝝢𝑁𝗡Ⲛ𝑵𝘕𝞜Ν𝕹"
StrongObfuscator["O"] = "0θϑ⍬ÒÓÔÕÖØŌŎŐƆƟƠǑǪǬǾȌȎȪȬȮȰΘΟϴОѲӦӨӪՕỌỎỐỒỔỘỚỜỞỠỢΌΌṌṐṒὈʘṎỖ߀𝛰𝖮〇𐊒𝟬𝒪𝜪ዐ𝓞𝞞𝝤ⵔՕ𝟢𝗢𝟘𝘖ⲞОΟଠ𝟎𝐎০୦𝔒𝕆𝙊Ｏ0𐊫𝙾ꓳ𝑂𐐄𝟶𝑶𝚶𐓂𝕺"
StrongObfuscator["P"] = "ƤΡРҎṔṖῬ₱ℙ𝖯𝛲𝝦𝜬𝒫𐊕𝞠𝓟ꓑ𝗣ℙ𝘗Р𝐏ΡⲢᏢ𝔓𝙋ᑭＰ𝙿𝑃𝚸𝑷"
StrongObfuscator["Q"] = "Ԛ𝖰𝔔𝒬𝙌𝓠𝚀𝑄𝗤ⵕ𝑸𝘘ℚ𝕼"
StrongObfuscator["R"] = "ŔŖŘȐȒṘṚṜṞ℞ɌⱤᎡ𝙍ꓣƦ𝐑𝖱ᖇ𐒴𝑅𝗥Ꮢ𝕽𝓡𝚁ℛℜℝ𝑹𝘙"
StrongObfuscator["S"] = "ŚŜŞŠȘЅՏṠṢṨṤṦ𝒮𝙎ꓢ𐐠Ѕ𝐒𝖲𝑆𝗦𐊖𝕊Տ𝕾ＳᏕ𝓢𝚂𝔖Ꮪ𝑺𝘚"
StrongObfuscator["T"] = "ŢŤŦƮȚΤТҬṪṬṮṰ₮ȾΊΊꚌ𝒯𝜯𝖳𝗧𐊗𐌕𝝩🝨ꓔ𝓣𝞣⟙𝔗𝘛𝙏ТᎢ⊤Τ𝐓Ⲧ𝑇𐊱𝕋𝕿Ｔ𝚃𝛵𝑻𝚻"
StrongObfuscator["U"] = "ÙÚÛÜŨŪŬŮŰŲƯǓǕǗǛȔȖԱՍṲṴṶṸỤỦỨỪỬỮỰǙ⊍⊎Մ⊌Ṻ𝒰𝙐ሀ⋃𝐔𝖴𝑈𝗨𑢸∪𝕌ᑌՍ𝖀𝓤𝚄ꓴ𐓎𝔘𝑼𝘜" #₮₦₭ƗĐĦ
StrongObfuscator["V"] = "ѴѶṼṾ⋁ⅤƲ𝒱𝓥𝗩𝘝Ꮩ𝐕𝔙𝕍Ⅴꓦ٧𝙑𝚅𝑉ᐯ𝑽Ѵ۷𝖁ⴸ𝖵"
StrongObfuscator["W"] = "ŴԜẀẂẄẆẈ₩ƜШ𝕎𝒲𝙒𝓦𝚆ꓪ𝑊𝗪𝑾𝘞ᎳᏔ𝖂𝐖𝖶𑣦Ԝ𝔚"
StrongObfuscator["X"] = "ΧХҲẊẌⅩ𝒳𝜲𝓧𝞦𐊐𝝬𐌗𝗫𝘟𝐗𝔛ⵝ𝕏𝙓ХΧⅩ𝚇ꓫⲬ᙭𝑋𐊴𝑿𝚾╳Ꭓ𝖃ᚷＸ𝛸𐌢𝖷"
StrongObfuscator["Y"] = "¥ÝŶŸƳȲΥΫϓУҮҰẎỲỴỶỸῨῩ𝜰𝒴𝓨𝗬𝝪𝘠ϒ𝞤𝐘𝔜𝕐У𝙔Υ𝚈ⲨᎩ𐊲𝑌ꓬҮ𝒀𝖸Ｙ𝛶𝚼Ꮍ"
StrongObfuscator["Z"] = "ŹŻŽƵȤΖẐẒẔ𝗭𝚭Ꮓ𝛧𝓩Ζ𝘡𝜡𝙕𝞕ꓜ𝝛𝐙𝑍ℤ𝚉𝒁Ｚ𝒵𝖹"
StrongObfuscator["a"] = "àáâãäåāăąǎǟǡǻȁȃȧаӑӓḁẚạảấầẩẫậắằẳẵặɑάαἀἁἂἃἄἅἆἇὰάᾀᾁᾂᾃᾄᾅᾆᾇᾰᾱᾲᾳᾴᾶᾷ⍶⍺ɑ"
StrongObfuscator["b"] = "ƀƃƅɒɓḃḅḇþϸƄьҍ𝑏𝗯Ƅ𝕓𝖇Ь𝓫𝚋Ꮟᖯ𝔟ᑲ𝒃𝘣𝒷𝙗𝐛𝖻"
StrongObfuscator["c"] = "çćĉċčƈςϛсҫḉⅽ¢ϲҁ𝑐𝗰сｃ𝕔ᴄⲥ𐐽𝖈𝓬𝚌ꮯ𝔠ϲ𝒄𝘤𝒸𝙘𝐜𝖼ⅽ"
StrongObfuscator["d"] = "ďđɖɗḋḍḏḑḓⅾƌժ₫ðԁ𝓭𝚍ⅆ𝑑𝗱Ꮷ𝒅𝘥𝖉ᑯꓒ𝐝𝖽𝔡𝕕ⅾ𝒹𝙙"
StrongObfuscator["e"] = "èéêëēĕėęěȅȇȩеѐёҽҿӗḕḗḙḛḝẹẻẽếềểễệεɛϵєϱѳөӫɵꤕ𝓮𝚎ｅ𝑒𝗲ⅇ𝒆𝘦℮𝖊ℯ𝐞𝖾ꬲе𝔢𝕖ҽ𝙚"
StrongObfuscator["f"] = "ſḟẛƒғϝ£ƒ𝓯𝚏ք𝑓𝗳𝒇𝘧𝖋𝐟𝖿𝔣ꬵ𝕗ꞙ𝒻𝙛ẝſ"
StrongObfuscator["g"] = "ĝğġģǥǧǵɠɡգզցḡɕʛɢ𝓰𝚐ɡցᶃ𝑔𝗴ｇ𝒈𝘨ℊ𝖌ƍ𝐠𝗀𝔤𝕘𝙜"
StrongObfuscator["h"] = "ĥħȟɦɧћիհḣḥḧḩḫẖℏһʜӊᏂ𝖍𝓱𝚑ｈ𝔥ℎ𝒉𝘩հ𝒽𝙝𝐡𝗁𝗵һ𝕙"
StrongObfuscator["i"] = "į¡ìíîïĩīĭįıǐȉȋɨɩΐίιϊіїɪḭḯỉịἰἱἲἳὶίῑΐῐῒῖὶ𝓲𝞲ꙇⅈｉ𝔦𝘪ӏ𝙞𝚤𝐢і𝑖𝕚𝖎Ꭵ𝚒ɪ𝒊𝛊ⅰı𝒾𝜾⍳𝜄ꭵ𝗂𝝸ℹ𝗶 "
StrongObfuscator["j"] = "ĵǰȷɟʝјյϳ𝖏𝓳𝚓ⅉ𝔧ｊ𝒋𝘫𝒿𝙟ϳ𝐣𝗃ј𝑗𝗷𝕛"
StrongObfuscator["k"] = "ķĸƙǩκкҝҟḱḳḵ𝖐𝓴𝚔𝔨𝒌𝘬𝓀𝙠𝐤𝗄𝑘𝗸𝕜"
StrongObfuscator["l"] = "ŀĺļľłƚǀɫɬɭḷḹḻḽŀ⎩ḹ𝚰𝘭І𝖨𝐥ﺎ𝔩𐊊Ⲓ𐌉ℓ𝜤Ɩ𝞘Ι𝚕𝟏∣اＩ𝗅𝕀1𝙄𝓁𐌠𝐼׀𝑰ǀӀᛁ𝟭Iߊｌ𝛪ⵏ𝝞𝕝𝟣𝙡𝓘𝗜𝟙𝑙ןⅠ𝘐١𝒍𝖑￨𝐈ꓲ𝙸𝟷𝓵|ⅼ𝗹"
StrongObfuscator["m"] = "ɱḿṁṃ₥ⅿ𝒎𝘮𝖒𝐦𝗆𝔪𝕞𝓂𝙢𝓶𝚖𝑚𝗺ⅿ"
StrongObfuscator["n"] = "ɴñńņňŉŋƞǹɲɳήηπпբդըղոռրṅṇṉṋἠἡἢἣἤἥἦἧὴήᾐᾑᾒᾓᾔᾕᾖᾗῂῃῄῆῇი𝒏𝘯𝖓𝐧𝗇𝔫𝕟𝓃𝙣ո𝓷𝚗ռ𝑛𝗻"
StrongObfuscator["o"] = "òóôσöōŏőơǒǫǭȍȏȫȭȯȱʘοόоӧծձօṍṏṑṓọỏốồổỗộớờởỡợὀὁὂὃὄὅὸόσ๐𝘰"+"ం"+"ಂ"+"ം"+"ං"+"օ𝐨𝔬ᴏᴑ𐓪𝚘ဝⲟ𝛐ഠ𝛔ﮦ𝗈𝝈ℴ𝝄𝞸𝞼ꬽоο၀σｏ๐໐𝕠𐐬𝙤𝑜𝒐𝜎𝖔٥०੦૦௦౦೦൦ﻩ𝜊𝝾𝞂𝓸𝗼ჿ"
StrongObfuscator["p"] = "þρрҏթṕṗῤῥ⍴рρ𝔭𝘱𝙥𝐩ｐ𝛠𝑝𝕡𝖕𝜚𝚙𝞎ⲣ𝝔𝛒𝒑𝟈𝝆𝓅𝜌𝗉𝞀ϱ𝗽⍴𝞺𝓹"
StrongObfuscator["q"] = "ʠԛգզϙ𝔮գ𝒒𝘲զ𝓆𝙦𝐪𝗊𝑞𝗾𝕢𝖖ԛ𝓺𝚚"
StrongObfuscator["r"] = "ŕŗřȑȓɼɽгѓґӷṙṛṝṟгѓґӷ𝔯ꮁ𝒓𝘳ⲅᴦꭇꭈ𝓇𝙧𝐫𝗋𝑟𝗿г𝕣𝖗𝓻𝚛"
StrongObfuscator["s"] = "śŝşšșʂѕԑṡṣṥṧṩ𝔰𝒔𝘴𝓈𝙨ꮪ𝐬𝗌𝑠𝘀ꜱｓ𝕤ѕ𝖘𝓼𝚜𐑈ƽ"
StrongObfuscator["t"] = "ţťŧƫțʈṫṭṯṱẗȶէե†ԷՒէȽҭ𝐭𝗍𝔱𝕥𝓉𝙩𝓽𝚝𝑡𝘁𝒕𝘵𝖙"
StrongObfuscator["u"] = "µùúûüũūŭůűųưǔǖǘǚǜȕȗɥμυцկմնսվևṳṵṷṹṻụủứừửữự𝐮υ𝔲𝕦ʋ𝙪ꭎ𐓶𝚞ꭒ𝑢𝒖𝛖ᴜ𝖚ꞟ𝜐𝗎𝓊𝝊𝓾𝞾𝞄𝘂𝘶ս"
StrongObfuscator["v"] = "ʋνѵѷүұṽṿⅴ∨ΰϋύὐὑὒὓὔὕὖὗὺύῠῡῢΰῦῧʋ⋁𝐯𝔳𝕧𝙫𝚟𝑣ｖט𝒗𝖛ᴠ𝗏𝛎∨𝜈ꮩ𝓋𝓿ⅴ𝘃ѵ𝝂𝘷𝞶𝝼ν"
StrongObfuscator["w"] = "ŵԝẁẃẅẇẉẘ𝐰𝗐ᴡѡաꮃ𝔴𝕨𝓌𝙬ɯ𝔀𝚠𝑤𝘄𝒘𝘸𝖜ԝ"
StrongObfuscator["x"] = "ϰхҳẋẍⅹᕁ𝓍𝙭х𝐱𝗑⤫𝑥𝘅⤬᙮⨯𝕩𝖝×𝔁𝚡ｘⅹ𝔵ᕽ𝒙𝘹"
StrongObfuscator["y"] = "ýÿŷƴȳγуўӯӱӳẏẙỳỵỷỹʏ𝙮у𝐲𝝲𝑦ᶌ𝞬𝕪ʏ𝚢ｙꭚ𝒚𝓎ɣ𝗒ყ𝘆ү𝛾γ𝛄𝔂𝜸𝔶ℽ𝘺ỿ"
StrongObfuscator["z"] = "źżžƶȥʐʑẑẓẕ𝓏𝙯ᴢ𝐳𝗓𝑧𝘇𝕫ꮓ𝔃𝚣𝔷𝒛𝘻"
StrongObfuscator["0"] = "ዐ𝟬𝟶𝛰𝖮〇𐊒𝟬𝒪𝜪Oዐ𝓞𝞞𝝤ⵔՕ𝟢𝗢𝟘𝘖ⲞОΟଠ𝟎𝐎০୦𝔒𝕆𝙊Ｏ𐊫𝙾ꓳ𝑂𐐄𝟶𝑶𝚶𐓂𝕺"
StrongObfuscator["1"] = "𝐥𝚕𝟏𝟭ｌ𝟣𝟙Ⅰ𝒍l𝙸𝟷ⅼ"
StrongObfuscator["2"] = "ƻƨշ𝟐𝟮𝟤𝟸𝟚"
StrongObfuscator["3"] = "ЗҘӞƷӠЗҘӞՅɜɝзҙӟӠ𝟯𝟑Ꝫ𝟥ꞫⳌ𝖟Ȝ𝟛𝟹"
StrongObfuscator["4"] = "ЧЧӴ𝟰𝟒𝟦𝟜𝟺"
StrongObfuscator["5"] = "Ƽ𝟝𝟓𝟱𝟧𝟻"
StrongObfuscator["6"] = "əǝәб𝟞Ⳓ𝟔𝟲𝟨𝟼"
StrongObfuscator["7"] = "𝟟𝟽𝟳𐓒𝟕𝟩"
StrongObfuscator["8"] = "𐌚Ȣȣ𝟴𝟪𝟠𝟾𝟖"
StrongObfuscator["9"] = "Ⳋ𝟫Ꝯ𝟿𝟡𝟗𝟵"

# TODO: From Online fancytext etc abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789

Leetspeak = {}  #from wikipedia/leetspeak
Leetspeak['A'] = ['4', '@', '?', '^', 'α', 'λ', '/\\', '/-\\']
Leetspeak['B'] = ['8', '|3', 'ß', 'l³', '13', 'I3', 'J3']
Leetspeak['C'] = ['(', '[', '<', '©', '¢']
Leetspeak['D'] = ['|)', '|]', 'Ð', 'đ', '1)']
Leetspeak['E'] = ['3', '€', '&', '£', 'ε']
Leetspeak['F'] = ['|=', 'PH', '|*|-|', '|"', 'ƒ', 'l²']
Leetspeak['G'] = ['6', '&', '9']
Leetspeak['H'] = ['#', '4', '|-|', '}{', ']-[', '/-/', ')-(']
Leetspeak['I'] = ['!', '1', '|', '][', 'ỉ']
Leetspeak['J'] = ['_|', '¿']
Leetspeak['K'] = ['|<', '|{', '|(', 'X']
Leetspeak['L'] = ['1', '|_', '£', '|', '][_']
Leetspeak['M'] = ['|V|', ']V[', '|\/|', 'AA', '[]V[]', '|11', '^^', '(V)', '|Y|', '!\/!', "/\/\\", '/v\\', '/|\\']
Leetspeak['N'] = ['|\|', '/\/', '/V', '|V', '/\\/', '|1', '2', '?', '(\)', '11', 'r', '!\!']
Leetspeak['O'] = ['0', '9', '()', '[]', '*', '°', '<>', 'ø', '{[]}']
Leetspeak['P'] = ['9', '|°', 'p', '|>', '|*', '[]D', '][D', '|²', '|?', '|D']
Leetspeak['Q'] = ['0_', '0']
Leetspeak['R'] = ['2', '|2', '1²', '®', '?', 'я', '12', '.-']
Leetspeak['S'] = ['5', '$', '§', '?', 'ŝ', 'ş', 'z']
Leetspeak['T'] = ['7', '+', '†', "']['", '|']
Leetspeak['U'] = ['|_|', 'µ', '[_]', 'v']
Leetspeak['V'] = ['\/', '|/', '\|', "\\'"]
Leetspeak['W'] = ['\/\/', 'VV', '\A/', '\V/', "\\\\'", 'uu', '\^/', '\|/', 'uJ']
Leetspeak['X'] = ['><', ')(', '}{', '%', '?', '×', '][']
Leetspeak['Y'] = ['`/', '°/', '¥']
Leetspeak['Z'] = ['z', '2', '"/_']
Leetspeak['Ä'] = ['43', '°A°', '°4°']
Leetspeak['Ö'] = ['3', '°O°']
Leetspeak['Ü'] = ['|_|3', '°U°']



















